---
kind: type
id: T:Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
source: html/8f025460-c283-ea99-aa8a-5a36e11528f4.htm
---
# Autodesk.Revit.Exceptions.ModificationOutsideTransactionException

The exception that is thrown by the undo transaction framework when the modification operation to the model is outside of a transaction.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ModificationOutsideTransactionException : InvalidOperationException
```